# GetImage Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationItemFile..::..GetImage Method
FabricationItemFile Class See Also
---
Gets the image for the fabrication item file.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public virtual Bitmap GetImage()
```

Visual Basic
---
```text
Public Overridable Function GetImage As Bitmap
```

Visual C++
---
```text
public:
virtual Bitmap^ GetImage()
```

# ### Return Value
System.Drawing.Bitmap represents the fabrication item file image. nullNothingnullptra null reference (Nothing in Visual Basic) if there is no preview image.
# See Also
FabricationItemFile Class
Autodesk.Revit.DB Namespace